#include <stdio.h>
#include <string.h>

int main(void) {
    char s[] = "\x48\x65\x6C\x6C\x6F\t\x57\x6F\x72\x6C\x64\n";

    printf("%s", s);
    printf("STRLEN: %zu\n", strlen(s));
    printf("SIZEOF: %zu\n", sizeof(s));

    return 0;
}

/*
Программа печатает строку, записанную кодами символов

\t - символ табуляции (как нажатие клавиши Tab). Это один символ, который сдвигает курсор к следующей позиции табуляции. Он стоит между словами вместо пробела
\x48 - символ с шестнадцатеричным кодом 48. Это 'H'. Остальные: \x65 = 'e', \x6C = 'l', \x6F = 'o', \x57 = 'W', \x72 = 'r', \x64 = 'd'. Шестнадцатеричными кодами записаны все буквы слов Hello и World
*/
